Repository: ksureshprojects/Projects
Catalog: Logic_Simulator/locale/*/LC_MESSAGES/I18Nwxapp.po
Languages: el

source: &About
el: &Despre

source: &Exit
el: &Închide

source: &Open
el: &Deschide

source: 2D Display
el: Vizualizare 2D

source: 3D Display
el: Vizualizare 3D

source: &File
el: &Fișier

source: View
el: &Vizualizare

source: Language
el: Limba

source: Run
el: Rulează

source: Continue
el: Continuă

source: Apply
el: Aplică

source: Show
el: Arată

source: Remove
el: Ascunde

source: 2D View
el: Imagine 2D

source: 3D View
el: Imagine 3D

source: Reset View
el: Resetează cadrul

source: Reload File
el: Reîncarcă

source: Activity Log
el: Jurnal de activitate

source: Cycles
el: Cicluri

source: Configure Devices
el: Configurează dispozitiv

source: Outputs
el: Ieșiri

source: Monitored Outputs
el: Ieșiri monitorizate

source: ***Error: Network oscillating
el: ***EROARE: Circuit oscilant

source: Logic Simulator Created by
el: Logic Simulator Creat de

source: 2019 IIB Summer Term
el: μπορεί επίσης να εμφανιστεί Ελληνικά

source: About Logsim
el: Despre Logsim

source: Running for
el: Rulând pentru

source: cycles
el: cicluri

source: Error! Nothing to continue. Run first.
el: ***EROARE: Nu se poate continua. Rulează mai întâi

source: Continuing for
el: Continuând pentru

source: cycles.
el: cicluri

source: Successfully set switch
el: Setat cu succes întrerupătorul

source: Error! Invalid switch.
el: ***EROARE: Întrerupătorul e invalid.

source: Error! Switch state must be
el: ***EROARE: Întrerupătorul poate fi setat doar cu

source: 0 (OFF) or 1 (ON).
el: 0 (OPRIT) sau 1 (PORNIT).

source: Successfully set CLOCK
el: Setat cu success ceasul

source: half-period to
el: la jumătate de perioadă

source: Error! Invalid CLOCK.
el: ***EROARE: Ceas invalid.

source: Error! CLOCK half-period must be
el: ***EROARE: Perioada ceasului trebuie sa fie

source: positive integer
el: număr întreg mai mare ca zero

source: Successfully made monitor.
el: Creat cu succes monitorul.

source: Error! Monitor already
el: ***EROARE: Monitor deja

source: selected.
el: existent.

source: Successfully zapped monitor
el: Ascuns cu succes monitorul

source: Error! Could not zap monitor.
el: ***EROARE: Nu s-a putut ascunde monitorul.

source: Open Text file
el: Deschide fișier text

source: Text files
el: Fișiere text

source: Successfully loaded new file!
el: Încărcat cu succes fișier nou!

source: Successfully reloaded file!
el: Reîncărcat cu succes fișierul

source: ***ERROR: Circuit could not
el: ***EROARE: Circuitul nu a putut fi

source: be parsed. Try again
el: descifrat. Mai Încearcă

source: ***ERROR: Expected DEVICES keyword
el: ***EROARE: Se aștepta cuvânt cheie DEVICES

source: ***ERROR: Expected CONNECTIONS keyword
el: ***EROARE: Se aștepta cuvânt cheie CONNECTIONS

source: ***ERROR: Expected MONITORS keyword
el: ***EROARE: Se aștepta cuvânt cheie MONITORS

source: ***ERROR: Expected END keyword
el: ***EROARE: Se aștepta cuvânt cheie END

source: ***ERROR: Expected End Of File
el: ***EROARE: Se aștepta sfârșit de fișier

source: ***ERROR: Expected a colon
el: ***EROARE: Se aștepta două puncte

source: ***ERROR: Expected a comma
el: ***EROARE: Se aștepta o virgulă

source: ***ERROR: Expected a semicolon
el: ***EROARE: Se aștepta punct si virgulă

source: ***ERROR: Expected an equals symbol
el: ***EROARE: Se aștepta un egal

source: ***ERROR: Expected a positive integer or 0
el: ***EROARE: Se aștepta un număr întreg mai mare ca 0

source: ***ERROR: Expected a string of characters not including reserved words
el: ***EROARE: Se aștepta un șir de caractere diferit de cuvinte cheie

source: ***ERROR: Expected logic types CLOCK, SWITCH, AND, NAND, NOR, OR, DTYPE, SIGGEN or XOR
el: ***EROARE: Se aștepta tipuri logice CLOCK, SWITCH, AND, NAND, NOR, OR, DTYPE, SIGGEN sau XOR

source: ***ERROR: Expected a left bracket
el: ***EROARE: Se aștepta paranteză stângă

source: ***ERROR: Expected a right bracket
el: ***EROARE: Se aștepta paranteză dreaptă

source: ***ERROR: Invalid configuration variable
el: ***EROARE: Variabilă de configurație invalidă

source: ***ERROR: Expected configuration variable
el: ***EROARE: Se aștepta o variabilă de configurație

source: ***ERROR: Did not expect configuration variable
el: ***EROARE: Nu se aștepta o variabilă de configurație

source: ***ERROR: Device already defined
el: ***ERROR: Dispozitiv deja definit

source: ***ERROR: Too many configuration variables specified
el: ***ERROR: Prea multe variabile de configurație specificate

source: ***ERROR: Invalid configuration variables used -
el: ***EROARE: Variabilele de configurație folosite sunt invalide

source: only 0s and 1s accepted
el: doar 0 și 1 sunt acceptate

source: ***ERROR: Input is connected to an input
el: ***ERROR: Intrare conectată la intrare

source: ***ERROR: Output is connected to an output
el: ***ERROR: Ieșire conectată la ieșire

source: ***ERROR: Input has already been connected
el: ***ERROR: Intrare deja conectată

source: ***ERROR: Port is absent
el: ***ERROR: Portul e inexistent

source: ***ERROR: Device is absent
el: ***ERROR: Dispozitivul e absent

source: ***ERROR: Only monitor outputs
el: ***ERROR: Se pot monitoriza doar ieșiri

source: ***ERROR: Output has already been monitored
el: ***ERROR: Ieșire deja monitorizată

source: ***ERROR: Unused inputs in file definition
el: ***ERROR:Intrări definite nefolosite

source: Total number of errors:
el: Număr total de erori:

source: Line:
el: Linia:
